InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Операция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидРабот</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ШтрихкодыНоменклатуры/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Номенклатура") Тогда
		УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Номенклатура", Параметры.Номенклатура);
		Если НЕ (Параметры.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас 
			ИЛИ Параметры.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга
			ИЛИ Параметры.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа)
			Тогда
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru='Штрихкоды хранятся только для запасов, работ и услуг';uk='Штрихкоди зберігаються тільки для запасів, робіт і послуг'");
			Элементы.Список.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
